-- 6.ROUND() 四舍五入函数,专门用来处理数值型数据的
-- 用法：ROUND(要四舍五入的数字,四舍五入到哪一位)，默认保留整数位

-- 员工表的月薪字段的数据类型是double(7,2),数据的总长度是7位,小数点后占两位
UPDATE 员工表
SET 月薪 = 736.365
WHERE 员工编号 = 0001;

SELECT *
FROM 员工表;

-- 查询0001的工资,精确到不同的位数
SELECT 员工编号,
       员工姓名,
       月薪            "原始的工资",
       ROUND(月薪)     "精确到个位的工资",
       ROUND(月薪, 0)  "精确到个位的工资",
       ROUND(月薪, 1)  "精确到小数点后一位的工资",
       ROUND(月薪, -1) "精确到小数点后负一位(也就是10位)的工资"
FROM 员工表
WHERE 员工编号 = 0001;

-- 下面的查询语句中没有FROM,实际上是从数据库的系统表中查询相同的数据
SELECT 189.356 "原始数据", ROUND(189.356, 0) "精确到个位", ROUND(189.356, 1) "精确到小数点后一位", ROUND(189.356, -1) "精确到十位";

-- 恢复数据
UPDATE 员工表
SET 月薪 = 800
WHERE 员工编号 = 0001;