-- 使用DISTINCT去除查询结果中重复的记录
-- DISTINCT可以去除单列数据重复的数据,也可以去除多列重复的数据
-- DISTINCT只能出现在SELECT 关键字的后面


-- ======================================================================================================================
-- 1.使用DISTINCT去除单列重复的数据

-- 查询员工所从事的职位信息
SELECT 工作
FROM 员工表;

-- 在上面语句的查询结果中,有重复的数据,所以需要使用DISTINCT
SELECT DISTINCT 工作
FROM 员工表;

-- ======================================================================================================================
-- 2.使用DISTINCT去除多列重复的数据

-- 查询员工的职位信息和部门编号信息
SELECT 部门编号, 工作
FROM 员工表;

-- 上面的查询结果中,部门编号 + 工作字段组合有重复的数据,需要使用DISTINCT
SELECT DISTINCT 部门编号, 工作
FROM 员工表
ORDER BY 部门编号;